operations2-0/app/controllers/operations_controller.rb

   def index
      @operations = Operation.all
---
SELECT "operations".* FROM "operations"

   def show
      @operation = Operation.find(params[:id])
---
SELECT  "operations".* FROM "operations" WHERE "operations"."id" = ? LIMIT 1  [["id", 44]]

   def answer
      @operation = Operation.find(params[:id])
      op = @operation.op
      if op == '+'
         correct = @operation.op1 + @operation.op2
      elsif op == '-'
         correct = @operation.op1 - @operation.op2
      elsif op == 'x'
         correct = @operation.op1 * @operation.op2
      elsif op == '/'
         correct = @operation.op1 / @operation.op2
      end
      if params[:answer].to_i == correct
         @correct = true
         @operation.time = (params[:end_time].to_f - params[:init_time].to_f).fdiv(1000)
         @operation.save
---
SELECT  "operations".* FROM "operations" WHERE "operations"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "operations" SET "time" = ?, "updated_at" = ? WHERE "operations"."id" = ?  [["time", 8.03156884765625], ["updated_at", "2016-04-29 10:50:40.051236"], ["id", 7]]

   def export
	require 'csv'
        CSV.open('operations.csv', 'w') do |csv|
           csv << Operation.column_names
           Operation.all.each do |o|
---
SELECT "operations".* FROM "operations"